# Taps / Casks
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "birdayz/kaf"

# Standard
brew "ack"
brew "asdf"
brew "awscli"
brew "aws-vault"
brew "azure-cli"
brew "fasd"
brew "git"
brew "git-trim"
brew "gh"
brew "glances"
brew "gnupg"
brew "htop"
brew "jq"
brew "kaf"
brew "mas"
brew "reattach-to-user-namespace"
brew "sshuttle"
brew "telnet"
brew "tmux"
brew "tree"
brew "wget"
brew "xmlstarlet"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
cask "1password-cli"
cask "Alfred"
cask "appcleaner"
cask "brave-browser"
cask "chromedriver"
cask "daisydisk"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "forklift"
cask "google-chrome"
cask "hazel"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "keepingyouawake"
cask "miro"
cask "moom"
cask "paw"
cask "spotify"
cask "sourcetree"
cask "session-manager-plugin"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "microsoft-outlook"
cask "font-fira-code"
cask "whatsapp"

# App Store
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825 
mas "Pages", id: 409201541 
mas "Pocket", id: 568494494 
mas "Slack", id: 803453959
mas "Messenger", id: 1480068668 
