# Taps / Casks
tap "azure/functions"
tap "fishtown-analytics/dbt"

# Standard
brew "ack"
brew "asdf"
brew "awscli"
brew "azure-cli"
brew "azure-functions-core-tools@3"
brew "cowsay"
brew "dbt"
brew "elixir"
brew "elm"
brew "fasd"
brew "git"
brew "git-trim"
brew "gh"
brew "glances"
brew "gnupg"
brew "htop"
brew "jq"
brew "mas"
brew "reattach-to-user-namespace"
brew "sshuttle"
brew "telnet"
brew "tmux"
brew "tree"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Apps
cask "Alfred"
cask "appcleaner"
cask "brave-browser"
cask "chromedriver"
cask "dash"
cask "daisydisk"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "filebot"
cask "firefox"
cask "forklift"
cask "google-chrome"
cask "hazel"
cask "hammerspoon"
cask "hyper"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "keepingyouawake"
cask "miro"
cask "moom"
cask "notion"
cask "omnifocus"
cask "paw"
cask "spotify"
cask "sourcetree"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# App Store
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825 
mas "Pages", id: 409201541 
mas "Pocket", id: 568494494 
mas "1 Password", id: 1333542190
