# Standard
brew "ack"
brew "atuin"
brew "chezmoi"
brew "fzf"
brew "git"
brew "glances"
brew "gnupg"
brew "htop"
brew "jj"
brew "luarocks"
brew "libpq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "sq"
brew "starship"
brew "telnet"
brew "tree"
brew "wget"
brew "zellij"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zoxide"
brew "eza"

# Apps
cask "Alfred"
cask "daisydisk"
cask "firefox"
cask "forklift"
cask "ghostty"
cask "hazel"
cask "keepingyouawake"
cask "orbstack"
cask "rectangle"
cask "visual-studio-code"
cask "font-fira-code"

# Plex Server Specific
cask "filebot"
brew "rclone"
brew "watch"
